<?php
// Russian language

$lang_media = array(
	'fileDefaultHtml'	=> 'Файл не выбран', 
	'fileButtonHtml'	=> 'Выбрать',
	'Reload'			=> 'Перезагрузить файл',
	'Remove'			=> 'Удалить файл',
	
	'Filename'			=> 'Файл',
	'Filesize'			=> 'Размер',
	'Uploaded'			=> 'Загружен',
	'Comment'			=> 'Комментарий',
	
	'MaxFileSize'		=> 'Максимальный размер файла',
	'MaxImageSize' 		=> 'Макс. размер изображения',
	'MaxSessionSize' 	=> 'Общий объем загружаемых файлов',
	'CurrentSessionSize'=> 'Загружено за сессию',
	'pixels'			=> 'пикс.',
	
	'SaveSession'		=> 'Сохранить загруженные файлы вложений',
	
	// File sizes
	'gb' 	=> '&nbsp;гб',
	'mb' 	=> '&nbsp;мб',
	'kb' 	=> '&nbsp;кб',
	'b' 	=> '&nbsp;байт',

	'Errors' => array(
		'No_Permissions'	=> 'Недостаточно прав для загрузки вложения.',
		'No_target_dir'		=> 'Не найден каталог для перемещения файла.',
		'Ambigious_file'	=> 'Выбранный файл слишком велик.',
		'Partial_Upload'	=> 'Выбранный файл был загружен не полностью. Пожалуйста попробуйте еще раз.',
		'No_File'			=> 'Вы не выбрали файл для загрузки.',
		'Wrong_image_type' 	=> 'Некорректный тип изображения.',
		'Wrong_image_size' 	=> 'Некорректный размер изображения',
		'File_Exists'		=> 'Файл с таким именем уже существует',
		'Move_Error'		=> 'Ошибка перемещения файла',
		'File_too_big1'		=> 'Размер файла не может превышать ',
		'File_too_big2'		=> ' байт.',
		'Unknown'			=> 'Неизвестная ошибка! Пожалуйста свяжитесь с администратором.',
	),
);
